#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

int main()
{
	// 연산자: operators
	//
	// 1. 산술연산자: +, -, *, /, %
	// 2. 대입연산자: =, +=, -=, *=, /=, %=
	// 3. 증감연산자: ++, --
	// 4. 비교연산자: >, >=, <, <=, ==, !=
	// 5. 논리연산자: &&, II, !
	// 6. 삼항연산자: ?, :
	// 7. 비트연산자: <<, >>, &, |, ^, ~

	// 산술연산자
	int n1 = 5;
	int n2 = 3;
	int n3 = n1 + n2;
	printf("%d + %d = %d\n", n1, n2, n3);

	n3 = n1 - n2;
	printf("%d - %d = %d\n", n1, n2, n3);

	n3 = n1 * n2;
	printf("%d * %d = %d\n", n1, n2, n3);

	n3 = n1 / n2;
	printf("%d / %d = %d\n", n1, n2, n3);

	float f1 = n1 / (float)n2;
	printf("%d / %d = %f\n", n1, n2, f1);

	n3 = n1 % n2;
	printf("%d %% %d = %d\n", n1, n2, n3);

	// 대입연산자
	n3 = n1; // n1에 있는 값을 n3에 대입시켜라
	n3 += n1; // n3 = n3 + n1
	printf("n1 = %d, n3 = %d\n", n1, n3);

	n3 -= n1; // n3 = n3 - n1
	n3 *= n1; // n3 = n3 * n1
	n3 /= n1; // n3 = n3 / n1
	n3 %= n1; // n3 = n3 % n1


	// 증감연산자
	n1++; // n1 = n1 + 1
	n1--; // n1 = n1 - 1
	++n1; // n1 = n1 + 1
	--n1; // n1 = n1 - 1
	// printf("정수를 입력하세요: ");
	// scanf("%d", &n1);
	printf("입력 값: %d\n", n1);
	printf("n1++ ==> %d\n", n1++); // 10 ==> 11, post-fix
	printf("n1++ ==> %d\n", n1++); //11 ==> 12
	printf("++n1 ==> %d\n", ++n1); // 13 ==> 출력(13), pre-fix
	printf("n1 = %d\n", n1); // 13

	// 비교연산자
	n1 = 5;
	n2 = 3;
	n3 = n1 > n2; // 참 (0이 아닌 값이 저장)
	n3 = n1 < n2; // 거짓
	printf("n3 = % d\n", n3);
	printf("%d == %d 의 결과? %d\n", n1, n2, n1 == n2);
	printf("%d != %d 의 결과? %d\n", n1, n2, n1 != n2);

	// 논리연산자
	n3 = n1 > n2 && n1 == n2; // 0
	printf(" % d > % d && %d == % d 의 결과 ? % d\n", n1, n2, n1, n2, n3);
	n3 = n1 > n2 || n1 == n2; // 0
	printf(" % d > % d || % d == % d 의 결과 ? % d\n", n1, n2, n1, n2, n3);
	n3 = !(n1 == n2);
	printf("!(%d == %d)의 결과? %d\n", n1, n2, n3);

	// 삼항연산자
	printf("%s\n", n1 % 2 ? "홀수" : "짝수"); // 조건식(관계식, 논리식, 산술식) ? 조건식이 참일때 반환값 : 조건식이 거짓일때 반환값

	n3 = n1 % 2 ? 1 : 0;

	// 비트연산자
	// 10진수 <-> 2진수 <-> 16진수
	/*
	0 : 0000 0000
	1 : 0000 0001 v
	2 : 0000 0010 v
	3 : 0000 0011
	4 : 0000 0100 v
	5 : 0000 0101
	6 : 0000 0110
	7 : 0000 0111
	8 : 0000 1000 v
	9 : 0000 1001  09
	10 : 0000 1010 0A
	11 : 0000 1011 0B
	12 : 0000 1100 0C
	13 : 0000 1101 0D
	14 : 0000 1110 0E
	15 : 0000 1111 0F

	16 : 0001 0000 10
	
	컴퓨터에서 음수를 표현(저장)하는 방법 ==> 2의 보수를 사용
	0000 0010 ==> 2 ===> -2
	1111 1101 : 10진수 1의 각자리를 반전시킴(1의 보수)
	1111 1110 : -2

	0000 0001 : 1
	1111 1110 : 십진수 1의 1의 보수
	1111 1111 : -1
	1000 0000
	*/

	printf("%02X\n", 16);

	return 0; // 즉시 함수를 종료시킨다.
}